doc/ox-hugo-manual.org
#+TITLE: Ox-Hugo Manual
#+AUTHOR: Kaushal Modi

#+HUGO_BASE_DIR: .
#+HUGO_SECTION: doc

#+MACRO: imageclick [[file:./static/images/$1][file:/images/$1]]
#+MACRO: issue [[[https://github.com/kaushalmodi/ox-hugo/issues/$1][$1]]]

*** Hugo test site for this package
:PROPERTIES:
:EXPORT_FILE_NAME: tests-site
:EXPORT_HUGO_SLUG: tests-site
:END:
A [[https://github.com/kaushalmodi/ox-hugo/tree/master/test/site][site]] with bare-bones Hugo "theme" is used to live-test the
package --- you'll know why theme is double-quoted once you try out the
site on =hugo=.

Check out the [[https://raw.githubusercontent.com/kaushalmodi/ox-hugo/master/test/site/content-org/all-posts.org][example single Org file]]. That is created for testing various
Org->Hugo content and meta-data translation features. [[https://github.com/kaushalmodi/ox-hugo/tree/master/test/site/content/posts][Here]] are the
exported Markdown files.
**** How to try =ox-hugo= on that site?
1. Clone this repo.
2. =cd= to the =test/site/= directory and do:
   #+BEGIN_EXAMPLE
   make serve
   #+END_EXAMPLE
   - *Requires Hugo 0.25+*
3. Open =http://localhost:1337= in your browser.
4. In a different terminal, =cd= to the same =test/site/= directory.
5. Run:
   #+BEGIN_EXAMPLE
   make mdtree ORG=content-org/all-posts.org
   #+END_EXAMPLE
6. In few seconds, dozens of test posts will get created, with the
   =hugo server= aided preview in the browser zapping through each new
   created post.
**** Alternative way
1. Clone this repo.
2. =cd= to the =test/site/= directory and do:
   #+BEGIN_EXAMPLE
   hugo server -D --navigateToChanged
   #+END_EXAMPLE
   - =--navigateToChanged= requires Hugo 0.25+.
3. Above command will mention the localhost where the site is
   served. Open that in your browser.
4. In emacs, =(require  'ox-hugo)= or evaluate the =ox-hugo.el= from the
   cloned repo.
5. Open the [[https://raw.githubusercontent.com/kaushalmodi/ox-hugo/master/test/site/content-org/all-posts.org][=all-posts.org=]] file.
6. =C-c C-e H A= -- That will export *all* subtrees in the file to
   Markdown files.
7. In few seconds, dozens of test posts will get created, with the
   =hugo server= aided preview in the browser zapping through each new
   created post (needs that new feature =--navigateToChanged=
   introduced in Hugo 0.25).
